IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT PHRASE-FILE ASSIGN TO '../data/phrase.txt'
    ORGANIZATION IS LINE SEQUENTIAL.
DATA DIVISION.
FILE SECTION.
FD PHRASE-FILE.
01 PHRASE-LINE PIC X(256).
WORKING-STORAGE SECTION.
01 WS-EOF PIC A(1).
PROCEDURE DIVISION.
    OPEN INPUT PHRASE-FILE.
    MOVE 'N' TO WS-EOF.
    PERFORM UNTIL WS-EOF = 'Y'
        READ PHRASE-FILE INTO PHRASE-LINE
            AT END MOVE 'Y' TO WS-EOF
            NOT AT END DISPLAY PHRASE-LINE
        END-READ
    END-PERFORM.
    CLOSE PHRASE-FILE.
    STOP RUN.
